tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_REPEAT_2);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 2u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) != 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 1u,
           "REPEAT initializes a program-hole target");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 1u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) != 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 2u,
           "REPEAT retains provenance for a program-hole rewind");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 0u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) == 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 3u,
           "REPEAT clears RA when the counter reaches zero");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x55802u &&
               cpu->rcount == 0u && cpu->repeat_active == 0u &&
               (cpu->sr & 0x0010u) == 0u &&
               cpu->sequential_program_hole_pc == 0x55802u && cpu->cycles == 4u,
           "REPEAT executes the final program-hole iteration once");

    reset_processor_conformance(cpu, DSPIC33_PROGRAM_LIMIT);
    expect(state,
           dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 0u,
           "direct host entry into program hole remains a bounds stop");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "sequential provenance prepares exact next hole address");
    cpu->pc = 0x55802u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS &&
               cpu->sequential_program_hole_pc == 0u,
           "host PC rewrite cannot reuse stale sequential provenance");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, 0x000300u);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "sequential program hole prepares interrupt return");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000302u &&
               cpu->interrupt_log_entry[0] == DSPIC33_PROGRAM_LIMIT &&
               cpu->w[15] == 0x5004u && dspic33_read_word(cpu, 0x5000u) == 0x5800u &&
               dspic33_read_word(cpu, 0x5002u) == 0x0005u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 11u,
           "interrupt redirects and stacks program hole PC without provenance leak");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, DSPIC33_PROGRAM_LIMIT);
    load_instruction(state, cpu, 0x000006u, 0x000340u);
    load_instruction(state, cpu, 0x000340u, OPCODE_NOP);
    cpu->stop_on_trap = false;
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "same-PC interrupt prepares sequential provenance");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 0u &&
               cpu->last_trap == 1u && cpu->pc == 0x000342u && cpu->w[15] == 0x5004u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 2u,
           "unimplemented interrupt vector dispatches Address Error");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x00000cu, DSPIC33_PROGRAM_LIMIT);
    load_instruction(state, cpu, 0x000006u, 0x000340u);
    load_instruction(state, cpu, 0x000340u, OPCODE_NOP);
    cpu->stop_on_trap = false;
    cpu->w[15] = 0x5000u;
    cpu->pending_soft_traps[0].trap = 4u;
    cpu->pending_soft_traps[0].vector = 0x00000cu;
    cpu->pending_soft_traps[0].priority = 11u;
    cpu->pending_soft_traps[0].delay = 1u;
    cpu->pending_soft_traps[0].active = true;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->last_trap == 1u &&
               cpu->pc == 0x000340u && cpu->w[15] == 0x5004u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 1u,
           "unimplemented soft-trap vector dispatches Address Error");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000342u &&
               cpu->cycles == 2u,
           "Address Error handler continues after invalid soft-trap vector");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, DSPIC33_AUXILIARY_PROGRAM_BASE, OPCODE_NOP);
    cpu->pc = DSPIC33_AUXILIARY_PROGRAM_BASE - 2u;
    cpu->sequential_program_hole_pc = cpu->pc;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->pc == DSPIC33_AUXILIARY_PROGRAM_BASE &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 1u,
           "sequential hole provenance ends at auxiliary program boundary");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->pc == DSPIC33_AUXILIARY_PROGRAM_BASE + 2u,
           "auxiliary program boundary enters implemented Flash");
}

