tylertms/dspic33e-sim/conformance/processor.c
    prepare_nested_do_interrupt_case(state, cpu, 0x206u, false);
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 0u, 0u, 1u) &&
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 5u),
           "schedule both interrupts from the executing DO instruction");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x208u &&
               cpu->cycles == 1u && cpu->interrupt_depth == 0u &&
               cpu->nested_do_interrupt_armed &&
               cpu->nested_do_interrupt_end == 0x208u &&
               cpu->nested_do_interrupt_depth == 1u,
           "penultimate DO instruction event records the executing address");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x302u &&
               cpu->cycles == 11u && cpu->interrupt_depth == 1u &&
               cpu->nested_do_extra_decrement_depth == 1u &&
               !cpu->nested_do_interrupt_armed,
           "scheduled higher-priority request reaches the exact entry-cycle deadline");
    dspic33_write_word(cpu, 0x0800u, (uint16_t)(dspic33_read_word(cpu, 0x0800u) & ~1u));
    complete_nested_do_interrupt_case(state, cpu, true);

    prepare_nested_do_interrupt_case(state, cpu, 0x208u, false);
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 0u, 0u, 1u) &&
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 5u),
           "schedule nested requests from the final DO instruction");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x204u &&
               cpu->dcount == 2u && cpu->nested_do_interrupt_armed &&
               cpu->nested_do_interrupt_end == 0x208u,
           "final DO instruction event survives the loop-back PC update");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x302u &&
               cpu->nested_do_extra_decrement_depth == 1u &&
               !cpu->nested_do_interrupt_armed,
           "final DO instruction request participates in the four-cycle erratum");

    prepare_nested_do_interrupt_case(state, cpu, 0x204u, false);
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 0u, 0u, 1u) &&
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 5u),
           "schedule nested requests outside the final DO instructions");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x206u &&
               !cpu->nested_do_interrupt_armed,
           "earlier DO instruction event does not arm the erratum");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x302u &&
               cpu->nested_do_extra_decrement_depth == 0u &&
               !cpu->nested_do_interrupt_armed,
           "entry-time second request cannot become a replacement first request");

    for (divisor_index = 0u; divisor_index < sizeof(divisors) / sizeof(divisors[0]);
         divisor_index++) {
        prepare_nested_do_interrupt_case(state, cpu, 0x206u, false);
        dspic33_write_word(cpu, 0x0744u, divisors[divisor_index]);
        expect(state,
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 0u, 0u, 2u) &&
                   dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u,
                                    divided_deadlines[divisor_index]),
               "schedule nested requests across a divided instruction boundary");
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING && cpu->device_cycles == 2u &&
                   cpu->nested_do_interrupt_armed,
               "divided DO instruction records its interrupt request cycle");
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x302u &&
                   cpu->nested_do_extra_decrement_depth == 1u &&
                   !cpu->nested_do_interrupt_armed,
               "DOZE and ROI preserve the four-instruction-cycle erratum window");
    }

    for (entry_index = 0u; entry_index < sizeof(entries) / sizeof(entries[0]);
         entry_index++) {
        for (delay_index = 0u; delay_index < sizeof(delays) / sizeof(delays[0]);
             delay_index++) {
            prepare_nested_do_interrupt_case(state, cpu, entries[entry_index], false);
            enter_first_nested_do_interrupt(state, cpu, true, delays[delay_index],
                                            delays[delay_index] == 4u);
            complete_nested_do_interrupt_case(state, cpu, delays[delay_index] == 4u);
        }
    }

    prepare_nested_do_interrupt_case(state, cpu, 0x204u, false);
    enter_first_nested_do_interrupt(state, cpu, false, 4u, false);
    complete_nested_do_interrupt_case(state, cpu, false);

    prepare_nested_do_interrupt_case(state, cpu, 0x208u, false);
    enter_first_nested_do_interrupt(state, cpu, true, 0u, false);
    dspic33_write_word(cpu, 0x0820u, 0u);
    for (delay_index = 0u; cpu->interrupt_depth != 0u && delay_index < 8u;
         delay_index++) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "single DO-loop interrupt handler returns normally");
    }
    expect(state,
           cpu->interrupt_depth == 0u && cpu->pc == 0x208u &&
               cpu->nested_do_interrupt_armed,
           "single DO-loop interrupt retains its window until the loop boundary");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->dcount == 2u &&
               !cpu->nested_do_interrupt_armed &&
               cpu->nested_do_interrupt_cycle == 0u &&
               cpu->nested_do_interrupt_end == 0u &&
               cpu->nested_do_interrupt_depth == 0u &&
               cpu->nested_do_interrupt_priority == 0u,
           "DO-loop boundary expires an unused nested-interrupt window");

    prepare_nested_do_interrupt_case(state, cpu, 0x208u, true);
    enter_first_nested_do_interrupt(state, cpu, false, 4u, false);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_depth == 1u &&
               cpu->interrupt_count == 1u && cpu->nested_do_extra_decrement_depth == 0u,
           "NSTDIS prevents the nested DO-loop erratum sequence");

