tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_CALL_0X300);
    load_instruction(state, cpu, 0x202u, 0u);
    load_instruction(state, cpu, 0x204u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0300u, OPCODE_RETURN);
    cpu->w[15] = 0x5000u;
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x3579u);
    expect_step_cycles(state, cpu, 4u, "CALL writes stack pointer");
    expect_step_cycles(state, cpu, 7u, "RETURN source depends on CALL stack write");
    expect_step_cycles(state, cpu, 1u, "RETURN does not create following dependency");
    expect(state, cpu->w[3] == 0x3579u, "post-RETURN source completes without stall");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_CALL_0X300);
    load_instruction(state, cpu, 0x202u, 0u);
    load_instruction(state, cpu, 0x204u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0300u, OPCODE_RETLW_0X10_W2);
    cpu->w[15] = 0x5000u;
    dspic33_set_working_register(cpu, 8u, 0x5000u);
    expect_step_cycles(state, cpu, 4u, "RETLW caller writes stack pointer");
    expect_step_cycles(state, cpu, 7u, "RETLW source depends on CALL stack write");
    expect_step_cycles(state, cpu, 2u, "RETLW destination creates dependency");
    expect(state, cpu->w[3] == 0x5000u, "RETLW dependency reads literal pointer");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0014u, 0x000300u);
    load_instruction(state, cpu, 0x0300u, OPCODE_RETFIE);
    dspic33_write_word(cpu, 0x1000u, 0x9abcu);
    cpu->w[15] = 0x5000u;
    expect_step_cycles(state, cpu, 1u, "interrupt dependency writer completes");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect_step_cycles(state, cpu, 14u,
                       "interrupt dispatch flushes pending dependency");
    dspic33_write_word(cpu, 0x0800u, 0u);
    expect_step_cycles(state, cpu, 1u,
                       "source after interrupt does not retain prior dependency");
    expect(state, cpu->w[3] == 0x9abcu, "post-interrupt source preserves value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_REPEAT_2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x1111u);
    dspic33_write_word(cpu, 0x1002u, 0x2222u);
    dspic33_write_word(cpu, 0x1004u, 0x3333u);
    expect_step_cycles(state, cpu, 1u, "REPEAT setup uses one cycle");
    expect_step_cycles(state, cpu, 1u, "first repeated pointer read has no dependency");
    expect_step_cycles(state, cpu, 2u, "middle repeated pointer read stalls");
    expect_step_cycles(state, cpu, 2u, "last repeated pointer read stalls");
    expect(state, cpu->w[2] == 0x1006u && cpu->w[3] == 0x3333u,
           "REPEAT dependency advances every iteration");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_DO_1);
    load_instruction(state, cpu, 0x202u, 0u);
    load_instruction(state, cpu, 0x204u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x5555u);
    dspic33_write_word(cpu, 0x1002u, 0xaaaau);
    expect_step_cycles(state, cpu, 2u, "DO setup uses two cycles");
    expect_step_cycles(state, cpu, 1u, "first DO pointer read has no dependency");
    expect_step_cycles(state, cpu, 2u, "looped DO pointer read stalls");
    expect(state, cpu->w[2] == 0x1004u && cpu->w[3] == 0xaaaau && cpu->do_depth == 0u,
           "DO dependency completes loop state");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W3);
    expect_step_cycles(state, cpu, 1u, "reset dependency writer completes");
    dspic33_reset(cpu, 0x202u);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0xabcdu);
    expect_step_cycles(state, cpu, 1u, "reset clears pending dependency");
    expect(state, cpu->w[3] == 0xabcdu, "post-reset source preserves value");
}

static void expect_dsp_x_page_transition(ProcessorConformance* state, Dspic33* cpu,
                                         uint32_t opcode, uint16_t pointer,
                                         uint16_t page, uint32_t program_address,
                                         uint16_t value, uint16_t expected_pointer,
                                         uint16_t expected_page, const char* name) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, opcode);
    expect(state, dspic33_load_program_word(cpu, program_address, value),
           "load DSP X transition value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, pointer);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x9002u, 0x6789u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = page;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 12 &&
               cpu->w[4] == value && cpu->w[5] == 0x6789u &&
               cpu->w[8] == expected_pointer && cpu->w[10] == 0x9000u &&
               cpu->dsrpag == expected_page && cpu->cycles == 5u,
           name);
}

static void dsp_x_prefetch_page_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    expect(state, dspic33_load_program_word(cpu, 0x0100u, 0x001234u),
           "load DSP X PSV value");
    expect(state, dspic33_load_program_word(cpu, 0x1002u, 0x009abcu),
           "load DSP Y isolation value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8100u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x8100u, 0x1111u);
    dspic33_write_word(cpu, 0x9002u, 0x5678u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 12 &&
               cpu->w[4] == 0x1234u && cpu->w[5] == 0x5678u && cpu->w[8] == 0x8102u &&
               cpu->w[10] == 0x9000u && cpu->dsrpag == 0x0200u && cpu->cycles == 5u &&
               cpu->corcon == 0x0021u && cpu->sr == 0u,
           "DSP X PSV prefetch maps through DSRPAG while Y remains base-only");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    expect(state, dspic33_load_program_word(cpu, 0x7ffeu, 0x003456u),
           "load DSP X crossing value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0xfffeu);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x9002u, 0x6789u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[4] == 0x3456u &&
               cpu->w[5] == 0x6789u && cpu->w[8] == 0x8000u && cpu->w[10] == 0x9000u &&
               cpu->dsrpag == 0x0201u && cpu->cycles == 5u,
           "DSP X post-increment reads the original PSV page before transition");

    expect_dsp_x_page_transition(
        state, cpu, OPCODE_DSP_X_W8_INCREMENT_4_Y_W10_DECREMENT, 0xfffcu, 0x0200u,
        0x7ffcu, 0x4567u, 0x8000u, 0x0201u,
        "DSP X four-byte post-increment crosses into the next PSV page");
    expect_dsp_x_page_transition(
        state, cpu, OPCODE_DSP_X_W8_INCREMENT_6_Y_W10_DECREMENT, 0xfffau, 0x0200u,
        0x7ffau, 0x5678u, 0x8000u, 0x0201u,
        "DSP X six-byte post-increment crosses into the next PSV page");
    expect_dsp_x_page_transition(
        state, cpu, OPCODE_DSP_X_W8_DECREMENT_4_Y_W10_DECREMENT, 0x8000u, 0x0201u,
        0x8000u, 0x6789u, 0xfffcu, 0x0200u,
        "DSP X four-byte post-decrement crosses into the prior PSV page");
    expect_dsp_x_page_transition(
        state, cpu, OPCODE_DSP_X_W8_DECREMENT_6_Y_W10_DECREMENT, 0x8000u, 0x0201u,
        0x8000u, 0x789au, 0xfffau, 0x0200u,
        "DSP X six-byte post-decrement crosses into the prior PSV page");
    expect_dsp_x_page_transition(
        state, cpu, OPCODE_DSP_X_W8_DECREMENT_Y_W10_DECREMENT, 0x8000u, 0x0201u,
        0x8000u, 0x89abu, 0xfffeu, 0x0200u,
        "DSP X two-byte post-decrement crosses into the prior PSV page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8100u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x8100u, 0x2468u);
    dspic33_write_word(cpu, 0x9002u, 0x789au);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[4] == 0x2468u &&
               cpu->w[5] == 0x789au && cpu->w[8] == 0x8102u && cpu->dsrpag == 1u &&
               cpu->cycles == 1u,
           "DSP X EDS prefetch retains data-space timing");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_INDEXED);
    expect(state, dspic33_load_program_word(cpu, 0x0100u, 0x00abcdu),
           "load indexed DSP X PSV value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 9u, 0x80feu);
    dspic33_set_working_register(cpu, 11u, 0x8ffeu);
    dspic33_set_working_register(cpu, 12u, 2u);
    dspic33_write_word(cpu, 0x9000u, 0x89abu);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    cpu->accumulator[0] = 5;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 17 &&
               cpu->w[4] == 0xabcdu && cpu->w[5] == 0x89abu && cpu->w[9] == 0x80feu &&
               cpu->w[11] == 0x8ffeu && cpu->w[12] == 2u && cpu->dsrpag == 0x0200u &&
               cpu->cycles == 5u,
           "indexed DSP X PSV prefetch does not update pointer or page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_INDEXED);
    expect(state, dspic33_load_program_word(cpu, 0x8000u, 0x00cdefu),
           "load indexed DSP X overflow value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 9u, 0xfffeu);
    dspic33_set_working_register(cpu, 11u, 0x8ffeu);
    dspic33_set_working_register(cpu, 12u, 2u);
    dspic33_write_word(cpu, 0x9000u, 0x9abcu);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0201u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 12 &&
               cpu->w[4] == 0xcdefu && cpu->w[5] == 0x9abcu && cpu->w[9] == 0xfffeu &&
               cpu->w[11] == 0x8ffeu && cpu->w[12] == 2u && cpu->dsrpag == 0x0201u &&
               cpu->cycles == 5u,
           "indexed DSP X overflow wraps within the current PSV page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_INDEXED);
    expect(state, dspic33_load_program_word(cpu, 0x7ffeu, 0x00def0u),
           "load indexed DSP X underflow value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 9u, 0x8000u);
    dspic33_set_working_register(cpu, 11u, 0x9002u);
    dspic33_set_working_register(cpu, 12u, 0xfffeu);
    dspic33_write_word(cpu, 0x9000u, 0x9abcu);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 12 &&
               cpu->w[4] == 0xdef0u && cpu->w[5] == 0x9abcu && cpu->w[9] == 0x8000u &&
               cpu->w[11] == 0x9002u && cpu->w[12] == 0xfffeu &&
               cpu->dsrpag == 0x0200u && cpu->cycles == 5u,
           "indexed DSP X underflow wraps within the current PSV page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_INDEXED);
    expect(state, dspic33_load_program_word(cpu, 0x7ff8u, 0x00def0u),
           "load indexed modulo DSP X PSV value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 9u, 0xfffeu);
    dspic33_set_working_register(cpu, 11u, 0x8ffeu);
    dspic33_set_working_register(cpu, 12u, 2u);
    dspic33_write_word(cpu, 0x0046u, 0x8009u);
    dspic33_write_word(cpu, 0x0048u, 0xfff8u);
    dspic33_write_word(cpu, 0x004au, 0xffffu);
    dspic33_write_word(cpu, 0x9000u, 0x9abcu);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == 12 &&
               cpu->w[4] == 0xdef0u && cpu->w[5] == 0x9abcu && cpu->w[9] == 0xfffeu &&
               cpu->w[11] == 0x8ffeu && cpu->w[12] == 2u && cpu->dsrpag == 0x0200u &&
               cpu->cycles == 5u,
           "indexed DSP X modulo wrap retains pointer and PSV page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    expect(state, dspic33_load_program_word(cpu, 0x7ffeu, 0x00bcdeu),
           "load modulo DSP X PSV value");
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0xfffeu);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x0046u, 0x8008u);
    dspic33_write_word(cpu, 0x0048u, 0xfff8u);
    dspic33_write_word(cpu, 0x004au, 0xffffu);
    dspic33_write_word(cpu, 0x9002u, 0x9abcu);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x0200u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[4] == 0xbcdeu &&
               cpu->w[5] == 0x9abcu && cpu->w[8] == 0xfff8u && cpu->dsrpag == 0x0200u &&
               cpu->cycles == 5u,
           "DSP X modulo wrap retains the PSV page");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 0xfffdu);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x9002u, 0xa55au);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 0x03ffu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->accumulator[0] == -12 &&
               cpu->w[4] == 0xfffdu && cpu->w[5] == 0xa55au && cpu->w[10] == 0x9000u &&
               cpu->dsrpag == 0x03ffu && cpu->cycles == 1u && cpu->corcon == 0x0021u &&
               cpu->sr == 0u,
           "DSP Y prefetch ignores DSRPAG without X activity");
}

