tylertms/dspic33e-sim/conformance/processor.c
static void dsp_prefetch_destination_collision_cases(ProcessorConformance* state,
                                                     Dspic33* cpu) {
    static const struct {
        uint32_t opcode;
        uint8_t destination;
        const char* execution;
    } cases[] = {
        {OPCODE_DSP_PREFETCH_W4_COLLISION, 4u, "DSP prefetch collision resolves W4"},
        {OPCODE_DSP_PREFETCH_W5_COLLISION, 5u, "DSP prefetch collision resolves W5"},
        {OPCODE_DSP_PREFETCH_W6_COLLISION, 6u, "DSP prefetch collision resolves W6"},
        {OPCODE_DSP_PREFETCH_W7_COLLISION, 7u, "DSP prefetch collision resolves W7"},
    };
    size_t index;

    for (index = 0u; index < sizeof(cases) / sizeof(cases[0]); index++) {
        dspic33_reset(cpu, 0u);
        load_instruction(state, cpu, 0u, cases[index].opcode);
        dspic33_set_working_register(cpu, 4u, 3u);
        dspic33_set_working_register(cpu, 5u, 4u);
        dspic33_set_working_register(cpu, 6u, 0x6666u);
        dspic33_set_working_register(cpu, 7u, 0x7777u);
        dspic33_set_working_register(cpu, 8u, 0x5000u);
        dspic33_set_working_register(cpu, 10u, 0x9002u);
        dspic33_write_word(cpu, 0x5000u, 0x1111u);
        dspic33_write_word(cpu, 0x9002u, 0x2222u);
        cpu->corcon = 0x0001u;
        cpu->sr = 0x000fu;
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 1u &&
                   cpu->accumulator[0] == 12 &&
                   cpu->w[cases[index].destination] == 0x2222u,
               cases[index].execution);
        expect(
            state,
            cpu->w[8] == 0x5002u && cpu->w[10] == 0x9004u && cpu->sr == 0x000fu &&
                cpu->corcon == 0x0001u && cpu->illegal_reset_count == 0u,
            "DSP prefetch collision completes both lanes and preserves control state");
    }

    dspic33_reset(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_MOVSAC_W4_COLLISION);
    dspic33_set_working_register(cpu, 4u, 0x4444u);
    dspic33_set_working_register(cpu, 8u, 0x5000u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x5000u, 0x1111u);
    dspic33_write_word(cpu, 0x9002u, 0x2222u);
    cpu->accumulator[0] = 0x123456789a;
    cpu->accumulator[1] = -0x123456789a;
    cpu->corcon = 0x0001u;
    cpu->sr = 0x010fu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 1u &&
               cpu->w[4] == 0x2222u && cpu->w[8] == 0x5002u && cpu->w[10] == 0x9004u,
           "MOVSAC prefetch collision resolves W4 after both lanes complete");
    expect(state,
           cpu->accumulator[0] == 0x123456789a &&
               cpu->accumulator[1] == -0x123456789a && cpu->sr == 0x010fu &&
               cpu->corcon == 0x0001u && cpu->illegal_reset_count == 0u,
           "MOVSAC prefetch collision preserves accumulators and control state");
}

typedef struct {
    uint8_t register_offset;
    int8_t access_offset;
    int8_t update;
    bool present;
} DspMatrixPrefetch;

enum {
    DSP_MATRIX_WRITE_BACK_DIRECT = 0u,
    DSP_MATRIX_WRITE_BACK_INDIRECT = 1u,
    DSP_MATRIX_WRITE_BACK_NONE = 2u
};

static const DspMatrixPrefetch dsp_matrix_prefetches[16] = {
    {0u, 0, 0, true},  {0u, 0, 2, true},  {0u, 0, 4, true},  {0u, 0, 6, true},
    {0u, 0, 0, false}, {0u, 0, -6, true}, {0u, 0, -4, true}, {0u, 0, -2, true},
    {1u, 0, 0, true},  {1u, 0, 2, true},  {1u, 0, 4, true},  {1u, 0, 6, true},
    {1u, 2, 0, true},  {1u, 0, -6, true}, {1u, 0, -4, true}, {1u, 0, -2, true},
};

static uint16_t dsp_matrix_base_value(uint8_t reg) {
    static const uint16_t values[4] = {0x5008u, 0x5108u, 0x9008u, 0x9108u};
    return values[reg - 8u];
}

static uint16_t dsp_matrix_prefetch_value(bool y_space, uint8_t operation) {
    return (uint16_t)((y_space ? 0x2200u : 0x1100u) | operation);
}

static void prepare_dsp_matrix_case(Dspic33* cpu, uint8_t target_accumulator,
                                    uint8_t x_operation, uint8_t y_operation,
                                    uint16_t expected_w[14]) {
    static const uint16_t values[10] = {
        2u, 3u, 5u, 7u, 0x5008u, 0x5108u, 0x9008u, 0x9108u, 2u, 0x5200u,
    };
    const DspMatrixPrefetch* x = &dsp_matrix_prefetches[x_operation];
    const DspMatrixPrefetch* y = &dsp_matrix_prefetches[y_operation];
    uint8_t reg;

    cpu->pc = 0u;
    cpu->sr = 0x000fu;
    cpu->corcon = 0x0001u;
    cpu->accumulator[target_accumulator] = 100;
    cpu->accumulator[target_accumulator ^ 1u] = 0x12348001;
    cpu->previous_working_register_writes = 0u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->last_interrupt = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->instruction_active = false;
    cpu->repeat_active = 0u;
    cpu->events.count = 0u;
    for (reg = 4u; reg <= 13u; reg++) {
        dspic33_set_working_register(cpu, reg, values[reg - 4u]);
        expected_w[reg] = values[reg - 4u];
    }
    dspic33_write_word(cpu, 0x5200u, 0xa5a5u);
    if (x->present) {
        uint8_t base = (uint8_t)(8u + x->register_offset);
        dspic33_write_word(cpu,
                           (uint16_t)(dsp_matrix_base_value(base) + x->access_offset),
                           dsp_matrix_prefetch_value(false, x_operation));
    }
    if (y->present) {
        uint8_t base = (uint8_t)(10u + y->register_offset);
        dspic33_write_word(cpu,
                           (uint16_t)(dsp_matrix_base_value(base) + y->access_offset),
                           dsp_matrix_prefetch_value(true, y_operation));
    }
}

static void apply_dsp_matrix_prefetch(uint16_t expected_w[14], uint8_t operation,
                                      uint8_t destination, bool y_space,
                                      bool write_destination) {
    const DspMatrixPrefetch* prefetch = &dsp_matrix_prefetches[operation];
    uint8_t base;
    if (!prefetch->present) {
        return;
    }
    base = (uint8_t)((y_space ? 10u : 8u) + prefetch->register_offset);
    expected_w[base] = (uint16_t)(dsp_matrix_base_value(base) + prefetch->update);
    if (write_destination) {
        expected_w[destination] = dsp_matrix_prefetch_value(y_space, operation);
    }
}

static void expect_dsp_matrix_case(ProcessorConformance* state, bool condition,
                                   uint32_t opcode, const char* domain) {
    state->cases++;
    if (condition) {
        state->passed++;
        return;
    }
    state->failed++;
    printf("[processor-failed] %s opcode=%06" PRIx32 "\n", domain, opcode);
}

