tylertms/dspic33e-sim/conformance/processor.c
typedef enum {
    ARITHMETIC_MATRIX_SUBR,
    ARITHMETIC_MATRIX_SUBBR,
    ARITHMETIC_MATRIX_ADD,
    ARITHMETIC_MATRIX_ADDC,
    ARITHMETIC_MATRIX_SUB,
    ARITHMETIC_MATRIX_SUBB
} ArithmeticMatrixOperation;

typedef struct {
    uint16_t address;
    bool direct;
} ArithmeticMatrixOperand;

static bool arithmetic_matrix_with_carry(ArithmeticMatrixOperation operation) {
    return operation == ARITHMETIC_MATRIX_SUBBR ||
           operation == ARITHMETIC_MATRIX_ADDC || operation == ARITHMETIC_MATRIX_SUBB;
}

static bool arithmetic_matrix_reverse(ArithmeticMatrixOperation operation) {
    return operation == ARITHMETIC_MATRIX_SUBR || operation == ARITHMETIC_MATRIX_SUBBR;
}

static bool arithmetic_matrix_addition(ArithmeticMatrixOperation operation) {
    return operation == ARITHMETIC_MATRIX_ADD || operation == ARITHMETIC_MATRIX_ADDC;
}

static uint16_t arithmetic_matrix_result(ArithmeticMatrixOperation operation,
                                         uint16_t left, uint16_t right,
                                         uint16_t initial_status, bool byte_mode) {
    uint32_t mask = byte_mode ? 0x00ffu : 0xffffu;
    uint16_t carry = (initial_status & 0x0001u) != 0u ? 1u : 0u;
    uint16_t borrow = arithmetic_matrix_with_carry(operation) && carry == 0u ? 1u : 0u;
    uint32_t result;

    left = (uint16_t)(left & mask);
    right = (uint16_t)(right & mask);
    if (arithmetic_matrix_addition(operation)) {
        result = (uint32_t)left + right +
                 (arithmetic_matrix_with_carry(operation) ? carry : 0u);
    } else if (arithmetic_matrix_reverse(operation)) {
        result = (uint16_t)(right - left - borrow);
    } else {
        result = (uint16_t)(left - right - borrow);
    }
    return (uint16_t)(result & mask);
}

static uint16_t arithmetic_matrix_status(ArithmeticMatrixOperation operation,
                                         uint16_t left, uint16_t right,
                                         uint16_t initial_status, bool byte_mode) {
    uint32_t mask = byte_mode ? 0x00ffu : 0xffffu;
    uint16_t sign = byte_mode ? 0x0080u : 0x8000u;
    uint16_t digit_mask = byte_mode ? 0x000fu : 0x00ffu;
    uint16_t carry = (initial_status & 0x0001u) != 0u ? 1u : 0u;
    uint16_t borrow = arithmetic_matrix_with_carry(operation) && carry == 0u ? 1u : 0u;
    uint16_t add_carry =
        arithmetic_matrix_addition(operation) && arithmetic_matrix_with_carry(operation)
            ? carry
            : 0u;
    bool sticky_zero = arithmetic_matrix_with_carry(operation);
    uint16_t status = (uint16_t)(initial_status & ~0x010fu);
    uint16_t value;

    left = (uint16_t)(left & mask);
    right = (uint16_t)(right & mask);
    value = arithmetic_matrix_result(operation, left, right, initial_status, byte_mode);
    if (value == 0u && (!sticky_zero || (initial_status & 0x0002u) != 0u)) {
        status |= 0x0002u;
    }
    if ((value & sign) != 0u) {
        status |= 0x0008u;
    }
    if (arithmetic_matrix_addition(operation)) {
        uint32_t result = (uint32_t)left + right + add_carry;
        int32_t signed_left = byte_mode ? (int8_t)left : (int16_t)left;
        int32_t signed_right = byte_mode ? (int8_t)right : (int16_t)right;
        int32_t signed_result = signed_left + signed_right + add_carry;
        int32_t minimum = byte_mode ? INT8_MIN : INT16_MIN;
        int32_t maximum = byte_mode ? INT8_MAX : INT16_MAX;
        if (result > mask) {
            status |= 0x0001u;
        }
        if (((left & digit_mask) + (right & digit_mask) + add_carry) > digit_mask) {
            status |= 0x0100u;
        }
        if (signed_result < minimum || signed_result > maximum) {
            status |= 0x0004u;
        }
    } else {
        uint16_t minuend = arithmetic_matrix_reverse(operation) ? right : left;
        uint16_t subtrahend = arithmetic_matrix_reverse(operation) ? left : right;
        uint32_t subtraction = (uint32_t)subtrahend + borrow;
        uint16_t operand = (uint16_t)(subtraction & mask);
        if (minuend >= subtraction) {
            status |= 0x0001u;
        }
        if ((minuend & digit_mask) >= (uint32_t)(subtrahend & digit_mask) + borrow) {
            status |= 0x0100u;
        }
        if ((((minuend ^ operand) & (minuend ^ value)) & sign) != 0u) {
            status |= 0x0004u;
        }
    }
    return status;
}

static void arithmetic_matrix_write_register(uint16_t registers[16], uint8_t reg,
                                             uint16_t value) {
    registers[reg] = reg == 15u ? (uint16_t)(value & 0xfffeu) : value;
}

static ArithmeticMatrixOperand arithmetic_matrix_operand(uint16_t registers[16],
                                                         uint8_t mode, uint8_t reg,
                                                         uint8_t width) {
    ArithmeticMatrixOperand operand = {0u, mode == 0u};
    int32_t adjusted;

    if (mode == 0u) {
        return operand;
    }
    if (mode == 1u) {
        operand.address = registers[reg];
        return operand;
    }
    if (mode == 2u || mode == 3u) {
        operand.address = registers[reg];
        adjusted =
            (int32_t)registers[reg] + (mode == 3u ? (int32_t)width : -(int32_t)width);
        arithmetic_matrix_write_register(registers, reg, (uint16_t)adjusted);
        return operand;
    }
    adjusted =
        (int32_t)registers[reg] + (mode == 5u ? (int32_t)width : -(int32_t)width);
    operand.address = (uint16_t)adjusted;
    arithmetic_matrix_write_register(registers, reg, (uint16_t)adjusted);
    return operand;
}

static void prepare_arithmetic_matrix_case(Dspic33* cpu, uint16_t registers[16],
                                           uint16_t initial_status) {
    uint8_t reg;

    cpu->pc = 0u;
    cpu->sr = initial_status;
    cpu->corcon = 0x0020u;
    cpu->previous_working_register_writes = 0u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->last_interrupt = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->instruction_active = false;
    cpu->repeat_active = 0u;
    cpu->do_depth = 0u;
    cpu->events.count = 0u;
    cpu->splim_enabled = false;
    for (reg = 0u; reg < 16u; reg++) {
        uint16_t value = (uint16_t)(0x4000u + (uint16_t)reg * 0x0100u);
        dspic33_set_working_register(cpu, reg, value);
        registers[reg] = cpu->w[reg];
    }
}

static bool arithmetic_matrix_registers_match(const Dspic33* cpu,
                                              const uint16_t registers[16]) {
    uint8_t reg;

