tylertms/dspic33e-sim/conformance/processor.c
static void arithmetic_encoding_matrix_cases(ProcessorConformance* state,
                                             Dspic33* cpu) {
    general_arithmetic_encoding_matrix_cases(state, cpu);
    literal_arithmetic_encoding_matrix_cases(state, cpu);
    arithmetic_flag_boundary_cases(state, cpu);
}

static bool direct_file_address_implemented(uint16_t address) {
    uint16_t target = (uint16_t)(address & 0x0ffeu);
    size_t low = 0u;
    size_t high = DSPIC33_SFR_ACCESS_ADDRESS_COUNT;

    if (address >= 0x1000u) {
        return true;
    }
    while (low < high) {
        size_t middle = low + (high - low) / 2u;
        uint16_t candidate = dspic33_sfr_access_expectations[middle].address;
        if (candidate < target) {
            low = middle + 1u;
        } else {
            high = middle;
        }
    }
    return low < DSPIC33_SFR_ACCESS_ADDRESS_COUNT &&
           dspic33_sfr_access_expectations[low].address == target;
}

static void prepare_direct_file_arithmetic_case(Dspic33* cpu, uint16_t address,
                                                uint8_t operation, bool byte_mode,
                                                bool file_destination) {
    uint8_t reg;
    uint16_t initial_status =
        (uint16_t)(((address >> 1u) & 1u) | (((address >> 2u) & 1u) << 1u));
    uint16_t operand =
        (uint16_t)(0x3101u + address * 17u + operation * 0x1111u +
                   (byte_mode ? 0x0080u : 0u) + (file_destination ? 0x0100u : 0u));

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    cpu->stop_on_trap = true;
    cpu->instructions = 0u;
    cpu->cycles = 0u;
    cpu->device_cycles = 0u;
    cpu->interrupt_count = 0u;
    cpu->software_reset_count = 0u;
    cpu->illegal_reset_count = 0u;
    cpu->trap_count = 0u;
    for (reg = 0u; reg < 15u; reg++) {
        dspic33_set_working_register(
            cpu, reg, (uint16_t)(0x4200u + (uint16_t)reg * 0x0101u + address));
    }
    dspic33_set_working_register(cpu, 0u, operand);
    dspic33_set_working_register(cpu, 15u, 0x5000u);
    cpu->sr = initial_status;
    cpu->corcon = 0x0020u;
    if (address >= 0x1000u) {
        dspic33_write_word(cpu, address & 0xfffeu,
                           (uint16_t)(0x5a00u ^ address ^ ((uint16_t)operation << 9u) ^
                                      (byte_mode ? 0x00c3u : 0u)));
    }
}

static void write_direct_file_reference_result(Dspic33* cpu, uint16_t value,
                                               bool byte_mode) {
    if (byte_mode) {
        cpu->w[0] = (uint16_t)((cpu->w[0] & 0xff00u) | (value & 0x00ffu));
    } else {
        cpu->w[0] = value;
        cpu->initialized_working_registers |= 0x0001u;
    }
    cpu->instruction_working_register_writes |= 0x0001u;
}

static bool direct_file_event_queues_match(const Dspic33* actual,
                                           const Dspic33* expected) {
    return actual->events.count == expected->events.count &&
           (actual->events.count == 0u ||
            memcmp(actual->events.items, expected->events.items,
                   actual->events.count * sizeof(*actual->events.items)) == 0);
}

static bool direct_file_io_states_match(const Dspic33* actual,
                                        const Dspic33* expected) {
    static Dspic33Io actual_io;
    static Dspic33Io expected_io;

    memcpy(&actual_io, &actual->io, sizeof(actual_io));
    memcpy(&expected_io, &expected->io, sizeof(expected_io));
    actual_io.cpu_write_cycle = expected_io.cpu_write_cycle;
    actual_io.cpu_write_address = expected_io.cpu_write_address;
    actual_io.cpu_write_previous = expected_io.cpu_write_previous;
    actual_io.cpu_write_width = expected_io.cpu_write_width;
    actual_io.cpu_write_valid = expected_io.cpu_write_valid;
    actual_io.cpu_read_address = expected_io.cpu_read_address;
    actual_io.cpu_read_width = expected_io.cpu_read_width;
    actual_io.cpu_read_valid = expected_io.cpu_read_valid;
    return memcmp(&actual_io, &expected_io, sizeof(actual_io)) == 0;
}

static bool direct_file_states_match(const Dspic33* actual, const Dspic33* expected) {
    static Dspic33 actual_state;
    static Dspic33 expected_state;

    memcpy(&actual_state, actual, sizeof(actual_state));
    memcpy(&expected_state, expected, sizeof(expected_state));

    actual_state.program = NULL;
    actual_state.auxiliary_program = NULL;
    actual_state.persistent_program = NULL;
    actual_state.data = NULL;
    actual_state.events.items = NULL;
    actual_state.events.capacity = 0u;
    expected_state.program = NULL;
    expected_state.auxiliary_program = NULL;
    expected_state.persistent_program = NULL;
    expected_state.data = NULL;
    expected_state.events.items = NULL;
    expected_state.events.capacity = 0u;
    return memcmp(&actual_state, &expected_state, sizeof(actual_state)) == 0 &&
           memcmp(actual->data, expected->data, 0x2000u) == 0 &&
           direct_file_event_queues_match(actual, expected);
}

static uint16_t run_direct_file_reference(Dspic33* cpu,
                                          ArithmeticMatrixOperation operation,
                                          uint16_t address, bool byte_mode,
                                          bool file_destination) {
    uint64_t device_ratio = dspic33_device_instruction_cycles(cpu, 1u);
    bool non_cpu_sfr = (address & (byte_mode ? 0xffffu : 0xfffeu)) >= 0x005au &&
                       address < 0x1000u && direct_file_address_implemented(address);
    uint16_t initial_status = cpu->sr;
    uint16_t right = byte_mode ? (uint8_t)cpu->w[0] : cpu->w[0];
    uint16_t left;
    uint16_t value;
    uint16_t status;
    uint8_t instruction_cycles = non_cpu_sfr ? 2u : 1u;
    size_t index;

    cpu->pc = 2u;
    cpu->instructions++;
    cpu->non_cpu_sfr_read = non_cpu_sfr;
    cpu->psv_read = false;
    cpu->psv_repeat_optimized = false;
    cpu->instruction_working_register_writes = 0u;
    cpu->instruction_source_address_registers = 0u;
    cpu->current_instruction_cycles = 1u;
    cpu->current_instruction_pc = 0u;
    cpu->instruction_active = true;
    left =
        byte_mode ? dspic33_read_byte(cpu, address) : dspic33_read_word(cpu, address);
    value = arithmetic_matrix_result(operation, left, right, initial_status, byte_mode);
    status =
        arithmetic_matrix_status(operation, left, right, initial_status, byte_mode);
    cpu->sr = status;
    if (file_destination) {
        if (byte_mode) {
            dspic33_write_byte(cpu, address, (uint8_t)value);
        } else {
            dspic33_write_word(cpu, address, value);
        }
    } else {
        write_direct_file_reference_result(cpu, value, byte_mode);
    }
    cpu->instruction_active = false;
    cpu->previous_working_register_writes = cpu->instruction_working_register_writes;
    cpu->current_instruction_cycles = 0u;
    cpu->non_cpu_sfr_read = false;
    cpu->psv_read = false;
    cpu->psv_repeat_optimized = false;
    cpu->instruction_advancing = true;
    if (non_cpu_sfr) {
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
    } else {
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
    }
    for (index = 0u; index < 4u; index++) {
        Dspic33PendingSoftTrap* pending = &cpu->pending_soft_traps[index];
        if (pending->active && pending->delay != 0u) {
            pending->delay = pending->delay > instruction_cycles
                                 ? (uint8_t)(pending->delay - instruction_cycles)
                                 : 0u;
        }
    }
    cpu->instruction_advancing = false;
    return value;
}

static const Dspic33PendingSoftTrap* direct_file_pending_trap(const Dspic33* cpu) {
    const Dspic33PendingSoftTrap* selected = NULL;
    uint8_t current_priority = (uint8_t)(((cpu->corcon & 0x0008u) != 0u ? 8u : 0u) |
                                         ((cpu->sr >> 5u) & 0x07u));
    size_t index;

