tylertms/dspic33e-sim/conformance/processor.c
    if (file_destination) {
        matches = matches && cpu->w[0] == right;
    } else {
        matches = matches && cpu->w[0] == value;
    }
    return matches;
}

static void direct_file_arithmetic_encoding_matrix_cases(ProcessorConformance* state) {
    static const uint32_t bases[6] = {0xbd0000u, 0xbd8000u, 0xb40000u,
                                      0xb48000u, 0xb50000u, 0xb58000u};
    static Dspic33 actual;
    static Dspic33 reference;
    uint32_t cases = 0u;
    bool actual_initialized = dspic33_initialize(&actual);
    bool reference_initialized = dspic33_initialize(&reference);
    uint8_t operation;

    expect(state, actual_initialized && reference_initialized,
           "initialize direct-file arithmetic processors");
    if (!actual_initialized || !reference_initialized) {
        if (actual_initialized) {
            dspic33_destroy(&actual);
        }
        if (reference_initialized) {
            dspic33_destroy(&reference);
        }
        return;
    }
    expect(state,
           dspic33_load_program_word(&actual, 0x000004u, 0x000340u) &&
               dspic33_load_program_word(&actual, 0x000006u, 0x000340u) &&
               dspic33_load_program_word(&actual, 0x000008u, 0x000340u) &&
               dspic33_load_program_word(&actual, 0x00000au, 0x000340u) &&
               dspic33_load_program_word(&actual, 0x00000eu, 0x000340u) &&
               dspic33_load_program_word(&actual, 0x000010u, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x000004u, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x000006u, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x000008u, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x00000au, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x00000eu, 0x000340u) &&
               dspic33_load_program_word(&reference, 0x000010u, 0x000340u),
           "load direct-file arithmetic address-error vectors");
    for (operation = 0u; operation < 6u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint8_t file_destination;
            for (file_destination = 0u; file_destination < 2u; file_destination++) {
                uint16_t address;
                for (address = 0u; address < 0x2000u; address++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)file_destination << 13u) | address;
                    bool matches;

                    prepare_direct_file_arithmetic_case(&actual, address, operation,
                                                        byte_mode != 0u,
                                                        file_destination != 0u);
                    prepare_direct_file_arithmetic_case(&reference, address, operation,
                                                        byte_mode != 0u,
                                                        file_destination != 0u);
                    if (byte_mode == 0u && (address & 1u) != 0u) {
                        matches = run_direct_file_odd_word_case(
                            &actual, &reference, opcode,
                            (ArithmeticMatrixOperation)operation, address,
                            file_destination != 0u);
                    } else {
                        matches = dspic33_load_program_word(&actual, 0u, opcode) &&
                                  dspic33_load_program_word(&reference, 0u, opcode);
                        dspic33_step(&actual);
                        run_direct_file_reference(
                            &reference, (ArithmeticMatrixOperation)operation, address,
                            byte_mode != 0u, file_destination != 0u);
                        matches = matches &&
                                  (file_destination != 0u && address >= 0x08c0u &&
                                           address <= 0x08c7u
                                       ? direct_file_trap_register_state_matches(
                                             &actual, &reference)
                                       : direct_file_states_match(&actual, &reference));
                    }
                    expect_dsp_matrix_case(state, matches, opcode,
                                           "direct-file arithmetic encoding");
                    cases++;
                }
            }
        }
    }
    expect(state, cases == 196608u,
           "direct-file arithmetic encoding matrix is exhaustive");
    dspic33_destroy(&actual);
    dspic33_destroy(&reference);
}

static void run_legal_dsp_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                      uint32_t opcode, uint8_t target_accumulator,
                                      int64_t target_result, uint8_t x_operation,
                                      uint8_t y_operation, uint8_t x_destination,
                                      uint8_t y_destination, uint8_t write_back,
                                      int8_t difference_destination) {
    uint16_t expected_w[14] = {0u};
    uint16_t expected_memory = 0xa5a5u;
    uint64_t cycles;
    bool matches;
    uint8_t reg;

    prepare_dsp_matrix_case(cpu, target_accumulator, x_operation, y_operation,
                            expected_w);
    apply_dsp_matrix_prefetch(expected_w, x_operation, x_destination, false,
                              difference_destination < 0);
    apply_dsp_matrix_prefetch(expected_w, y_operation, y_destination, true,
                              difference_destination < 0);
    if (difference_destination >= 0) {
        expected_w[(uint8_t)difference_destination] =
            (uint16_t)(dsp_matrix_prefetch_value(false, x_operation) -
                       dsp_matrix_prefetch_value(true, y_operation));
    }
    if (write_back == DSP_MATRIX_WRITE_BACK_DIRECT) {
        expected_w[13] = 0x1235u;
    } else if (write_back == DSP_MATRIX_WRITE_BACK_INDIRECT) {
        expected_w[13] = 0x5202u;
        expected_memory = 0x1235u;
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u &&
              cpu->accumulator[target_accumulator] == target_result &&
              cpu->accumulator[target_accumulator ^ 1u] == 0x12348001 &&
              cpu->sr == 0x000fu && cpu->corcon == 0x0001u &&
              dspic33_read_word(cpu, 0x5200u) == expected_memory &&
              !cpu->address_error && !cpu->illegal_reset &&
              cpu->unsupported_opcode == 0u && cpu->last_trap == UINT16_MAX;
    for (reg = 4u; reg <= 13u; reg++) {
        matches = matches && cpu->w[reg] == expected_w[reg];
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal DSP encoding");
}

static void general_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                              uint32_t* legal_cases) {
    static const uint8_t pair_encodings[6] = {0u, 1u, 2u, 4u, 5u, 6u};
    static const uint8_t pair_left[6] = {0u, 0u, 0u, 1u, 1u, 2u};
    static const uint8_t pair_right[6] = {1u, 2u, 3u, 2u, 3u, 3u};
    static const int64_t operands[4] = {2, 3, 5, 7};
    static const struct {
        uint16_t bits;
        int8_t sign;
        bool replace;
        uint8_t write_back;
    } forms[8] = {
        {0x0003u, 1, true, DSP_MATRIX_WRITE_BACK_NONE},
        {0x4003u, -1, true, DSP_MATRIX_WRITE_BACK_NONE},
        {0x0002u, 1, false, DSP_MATRIX_WRITE_BACK_NONE},
        {0x0000u, 1, false, DSP_MATRIX_WRITE_BACK_DIRECT},
        {0x0001u, 1, false, DSP_MATRIX_WRITE_BACK_INDIRECT},
        {0x4002u, -1, false, DSP_MATRIX_WRITE_BACK_NONE},
        {0x4000u, -1, false, DSP_MATRIX_WRITE_BACK_DIRECT},
        {0x4001u, -1, false, DSP_MATRIX_WRITE_BACK_INDIRECT},
    };
    uint8_t pair;
    uint8_t accumulator;
    uint8_t form;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (pair = 0u; pair < 6u; pair++) {
        int64_t product = operands[pair_left[pair]] * operands[pair_right[pair]];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (form = 0u; form < 8u; form++) {
                int64_t result = forms[form].sign * product;
                if (!forms[form].replace) {
                    result += 100;
                }
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    0xc00000u |
                                    ((uint32_t)pair_encodings[pair] << 16u) |
                                    ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | forms[form].bits;
                                run_legal_dsp_matrix_case(state, cpu, opcode,
                                                          accumulator, result,
                                                          x_operation, y_operation,
                                                          (uint8_t)(4u + x_destination),
                                                          (uint8_t)(4u + y_destination),
                                                          forms[form].write_back, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void special_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                              uint32_t* legal_cases) {
    static const uint32_t families[2] = {0xc30000u, 0xc70000u};
    uint8_t family;
    uint8_t accumulator;
    uint8_t write_back;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (family = 0u; family < 2u; family++) {
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (write_back = 0u; write_back < 3u; write_back++) {
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    families[family] | ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | write_back;
                                run_legal_dsp_matrix_case(
                                    state, cpu, opcode, accumulator,
                                    family == 0u ? 0 : 100, x_operation, y_operation,
                                    (uint8_t)(4u + x_destination),
                                    (uint8_t)(4u + y_destination), write_back, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void square_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                             uint32_t* legal_cases) {
    static const int64_t operands[4] = {2, 3, 5, 7};
    uint8_t source;
    uint8_t accumulator;
    uint8_t replace;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (source = 0u; source < 4u; source++) {
        int64_t product = operands[source] * operands[source];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (replace = 0u; replace < 2u; replace++) {
                int64_t result = replace != 0u ? product : 100 + product;
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    0xf00000u | ((uint32_t)source << 16u) |
                                    ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | replace;
                                run_legal_dsp_matrix_case(
                                    state, cpu, opcode, accumulator, result,
                                    x_operation, y_operation,
                                    (uint8_t)(4u + x_destination),
                                    (uint8_t)(4u + y_destination),
                                    DSP_MATRIX_WRITE_BACK_NONE, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void euclidean_dsp_encoding_matrix_cases(ProcessorConformance* state,
                                                Dspic33* cpu, uint32_t* legal_cases) {
    static const int64_t operands[4] = {2, 3, 5, 7};
    uint8_t source;
    uint8_t accumulator;
    uint8_t operation;
    uint8_t destination;
    uint8_t x_operation;
    uint8_t y_operation;

    for (source = 0u; source < 4u; source++) {
        int64_t product = operands[source] * operands[source];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (operation = 2u; operation < 4u; operation++) {
                int64_t result = operation == 2u ? 100 + product : product;
                for (destination = 0u; destination < 4u; destination++) {
                    for (x_operation = 0u; x_operation < 16u; x_operation++) {
                        if (x_operation == 4u) {
                            continue;
                        }
                        for (y_operation = 0u; y_operation < 16u; y_operation++) {
                            uint32_t opcode;
                            if (y_operation == 4u) {
                                continue;
                            }
                            opcode = 0xf04000u | ((uint32_t)source << 16u) |
                                     ((uint32_t)accumulator << 15u) |
                                     ((uint32_t)destination << 12u) |
                                     ((uint32_t)x_operation << 6u) |
                                     ((uint32_t)y_operation << 2u) | operation;
                            run_legal_dsp_matrix_case(
                                state, cpu, opcode, accumulator, result, x_operation,
                                y_operation, 4u, 4u, DSP_MATRIX_WRITE_BACK_NONE,
                                (int8_t)(4u + destination));
                            (*legal_cases)++;
                        }
                    }
                }
            }
        }
    }
}

static void prepare_invalid_dsp_matrix_case(Dspic33* cpu) {
    uint8_t reg;
    cpu->pc = 0u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0001u;
    cpu->accumulator[0] = 0x123456789a;
    cpu->accumulator[1] = -0x123456789a;
    cpu->illegal_reset = false;
    cpu->last_trap = UINT16_MAX;
    cpu->stop_reason = DSPIC33_RUNNING;
    for (reg = 0u; reg < 15u; reg++) {
        dspic33_set_working_register(cpu, reg,
                                     (uint16_t)(0x5000u + (uint16_t)reg * 2u));
    }
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
}

static void run_invalid_dsp_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                        uint32_t opcode) {
    uint64_t illegal_resets;
    bool matches;
    uint8_t reg;

