tylertms/dspic33e-sim/conformance/processor.c
        prepare_move_registers(cpu, expected, 0x3000u, 4u);
        source =
            resolve_move_matrix_operand(expected, source_mode, source_register, 0u, 4u);
        if (source.direct) {
            source_register &= 0x0eu;
            low = expected[source_register];
            high = expected[source_register + 1u];
        } else {
            dspic33_write_word(cpu, source.address, 0x1111u);
            dspic33_write_word(cpu, (uint16_t)(source.address + 2u), 0x2222u);
            low = 0x1111u;
            high = 0x2222u;
        }
        destination = resolve_move_matrix_operand(expected, destination_mode,
                                                  destination_register, 0u, 4u);
        if (destination.direct) {
            destination_register &= 0x0eu;
            expected[destination_register] = low;
            expected[destination_register + 1u] = high;
            if (destination_register + 1u == 15u) {
                expected[15] &= 0xfffeu;
            }
        }
        cycles = cpu->cycles;
        matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                  dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                  cpu->cycles - cycles == 2u && cpu->sr == 0x010fu &&
                  cpu->unsupported_opcode == 0u && !cpu->illegal_reset &&
                  cpu->last_trap == UINT16_MAX &&
                  move_matrix_registers_match(cpu, expected);
        if (!destination.direct) {
            matches =
                matches && dspic33_read_word(cpu, destination.address) == low &&
                dspic33_read_word(cpu, (uint16_t)(destination.address + 2u)) == high;
        }
        expect_dsp_matrix_case(state, matches, opcode, "MOV.D encoding");
        if (load) {
            legal_loads++;
        } else {
            legal_stores++;
        }
    }
    expect(state, legal_loads == 704u, "MOV.D load encodings are exhaustive");
    expect(state, legal_stores == 640u, "MOV.D store encodings are exhaustive");
    expect(state, invalid == 64192u, "MOV.D illegal encodings are exhaustive");
}

static void move_data_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0x800000u; opcode <= 0x8fffffu; opcode++) {
        bool store = (opcode & 0x080000u) != 0u;
        uint8_t reg = (uint8_t)(opcode & 0x0fu);
        uint16_t encoded_address =
            (uint16_t)((((opcode >> 4u) & 0x7fffu) << 1u) & 0xffffu);
        uint32_t address;
        uint16_t transfer_value;
        uint64_t cycles;
        Dspic33StopReason reason;
        bool matches;

        if (opcode == 0x880000u || encoded_address >= 0xe000u) {
            dspic33_reset(cpu, 0u);
            dspic33_set_async_events(cpu, false);
        }
        prepare_move_matrix_case(cpu);
        cpu->dsrpag = 1u;
        cpu->dswpag = 1u;
        dspic33_set_working_register(cpu, 15u, 0x5000u);
        address = encoded_address < 0x8000u
                      ? encoded_address
                      : (uint32_t)(0x8000u | (encoded_address & 0x7fffu));
        if (store) {
            dspic33_set_working_register(
                cpu, reg, address >= 0x1000u ? (uint16_t)(0xa500u | reg) : 0u);
            transfer_value = cpu->w[reg];
        } else {
            dspic33_set_working_register(cpu, reg, 0x5a5au);
            transfer_value = 0xa55au;
            if (address >= 0x1000u && encoded_address < 0xe000u) {
                dspic33_write_word(cpu, address, 0xa55au);
            }
        }
        cycles = cpu->cycles;
        matches = dspic33_load_program_word(cpu, 0u, opcode);
        reason = dspic33_step(cpu);
        if (encoded_address >= 0xe000u) {
            matches = matches && reason == DSPIC33_TRAPPED && cpu->pc == 0x000340u &&
                      cpu->last_trap == 1u && cpu->last_trap_return == 2u;
        } else {
            matches = matches && reason == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->last_trap == UINT16_MAX;
        }
        matches = matches && cpu->cycles > cycles && cpu->unsupported_opcode == 0u &&
                  !cpu->illegal_reset;
        if (address >= 0x1000u && encoded_address < 0xe000u) {
            matches = matches &&
                      (store ? dspic33_read_word(cpu, address) == transfer_value
                             : cpu->w[reg] == (reg == 15u ? (transfer_value & 0xfffeu)
                                                          : transfer_value));
        }
        expect_dsp_matrix_case(state, matches, opcode, "direct data MOV encoding");
        cases++;
    }
    expect(state, cases == 1048576u, "direct data MOV encoding matrix is exhaustive");
}

static uint16_t move_matrix_logic_status(uint16_t status, uint16_t value,
                                         bool byte_mode) {
    uint16_t mask = byte_mode ? 0x00ffu : 0xffffu;
    uint16_t sign = byte_mode ? 0x0080u : 0x8000u;
    value &= mask;
    status &= (uint16_t)~0x000au;
    if (value == 0u) {
        status |= 0x0002u;
    }
    if ((value & sign) != 0u) {
        status |= 0x0008u;
    }
    return status;
}

static uint16_t move_matrix_file_value(uint16_t address, bool byte_mode) {
    switch (address & 3u) {
    case 0u:
        return 0u;
    case 1u:
        return byte_mode ? 0x0080u : 0x8000u;
    default:
        return byte_mode ? 0x0034u : 0x1234u;
    }
}

static void file_move_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu) {
    uint32_t cases = 0u;
    uint16_t address;
    uint8_t byte_mode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    expect(state, dspic33_load_program_word(cpu, 0x000006u, 0x000340u),
           "load file MOV address trap vector");
    for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
        for (address = 0u; address < 0x2000u; address++) {
            uint32_t opcode = 0xb7a000u | ((uint32_t)byte_mode << 14u) | address;
            uint64_t cycles;
            Dspic33StopReason reason;
            bool matches;

            dspic33_reset(cpu, 0u);
            dspic33_set_async_events(cpu, false);
            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, 0u, address >= 0x1000u ? 0xa5a5u : 0u);
            dspic33_set_working_register(cpu, 15u, 0x5000u);
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode);
            reason = dspic33_step(cpu);
            if (byte_mode == 0u && (address & 1u) != 0u) {
                matches = matches && reason == DSPIC33_TRAPPED &&
                          cpu->pc == 0x000340u && cpu->last_trap == 1u &&
                          cpu->last_trap_return == 2u;
            } else {
                matches = matches && reason == DSPIC33_RUNNING && cpu->pc == 2u &&
                          cpu->last_trap == UINT16_MAX;
            }
            matches = matches && cpu->cycles > cycles &&
                      cpu->unsupported_opcode == 0u && !cpu->illegal_reset;
            if (address >= 0x1000u && (byte_mode != 0u || (address & 1u) == 0u)) {
                matches = matches && (byte_mode != 0u
                                          ? dspic33_read_byte(cpu, address) == 0xa5u
                                          : dspic33_read_word(cpu, address) == 0xa5a5u);
            }
            expect_dsp_matrix_case(state, matches, opcode, "WREG-to-file MOV encoding");
            cases++;
        }
    }
    expect(state, cases == 16384u, "WREG-to-file MOV encoding matrix is exhaustive");

    cases = 0u;
    for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
        uint8_t file_destination;
        for (file_destination = 0u; file_destination < 2u; file_destination++) {
            for (address = 0u; address < 0x2000u; address++) {
                uint32_t opcode = 0xbf8000u | ((uint32_t)byte_mode << 14u) |
                                  ((uint32_t)file_destination << 13u) | address;
                uint16_t expected[16];
                uint16_t value;
                uint16_t expected_status;
                uint64_t cycles;
                Dspic33StopReason reason;
                bool matches;

                dspic33_reset(cpu, 0u);
                dspic33_set_async_events(cpu, false);
                prepare_move_registers(cpu, expected, 0x2000u, 2u);
                value = move_matrix_file_value(address, byte_mode != 0u);
                if (address >= 0x1000u) {
                    if (byte_mode != 0u) {
                        dspic33_write_byte(cpu, address, (uint8_t)value);
                    } else {
                        dspic33_write_word(cpu, address, value);
                    }
                } else if (address == 0x002eu) {
                    value = 2u;
                } else if (address == 0x0030u) {
                    value = 0u;
                } else {
                    value = byte_mode != 0u ? dspic33_read_byte(cpu, address)
                                            : dspic33_read_word(cpu, address);
                }
                expected_status =
                    move_matrix_logic_status(0x010fu, value, byte_mode != 0u);
                if (file_destination == 0u) {
                    expected[0] = byte_mode != 0u
                                      ? (uint16_t)((expected[0] & 0xff00u) | value)
                                      : value;
                }
                cycles = cpu->cycles;
                matches = dspic33_load_program_word(cpu, 0u, opcode);
                reason = dspic33_step(cpu);
                if (byte_mode == 0u && (address & 1u) != 0u) {
                    matches = matches && reason == DSPIC33_TRAPPED &&
                              cpu->pc == 0x000340u && cpu->last_trap == 1u &&
                              cpu->last_trap_return == 2u;
                } else {
                    matches = matches && reason == DSPIC33_RUNNING && cpu->pc == 2u &&
                              cpu->last_trap == UINT16_MAX &&
                              cpu->sr == expected_status &&
                              move_matrix_registers_match(cpu, expected);
                }
                matches = matches && cpu->cycles > cycles &&
                          cpu->unsupported_opcode == 0u && !cpu->illegal_reset;
                expect_dsp_matrix_case(state, matches, opcode,
                                       "file-to-destination MOV encoding");
                cases++;
            }
        }
    }
    expect(state, cases == 32768u,
           "file-to-destination MOV encoding matrix is exhaustive");
}

